<?php 

$nature = array(
    0 => '需要别人的喜欢和尊重。',
    1 => '有自我批判的倾向。',
    2 => '有许多可以成为优势的能力没有发挥出来，同时也有一些缺点，不过一般可以克服。',
    3 => '与异性交往有些困难，尽管外表上显得很从容，其实内心焦急不安。',
    4 => '有时怀疑自己所做的决定或所做的事是否正确。',
    5 => '喜欢生活有些变化，厌恶被人限制。',
    6 => '以自己能独立思考而自豪，别人的建议如果没有充分的证据不会接受。',
    7 => '认为在别人面前过于坦率地表露自己是不明智的。',
    8 => '有时外向、亲切、好交际，而有时则内向、谨慎、沉默。的有些抱负往往很不现实。',
);

$advantage = array(
    0 => '逻辑强，善分析，对美有鉴赏力；好看，有气质；客观；情商高',
    1 => '口才和反应力佳；喜欢独立思考，有创意和个性的想法',
    2 => '想法惊世骇俗，思维敏锐，做事细致，待人和善，温柔果断，有影响力，容易感染人',
    3 => '搞怪、无厘头、精灵、可爱、笑点多、冷、很聪明、善解人意、平易近人',
    4 => '细心、可爱、温柔、善解人意、影响力相当巨大',
    5 => '节制、聪明、有不靠脸吃饭的实力',
    6 => '口才和反应力佳；喜欢独立思考，有创意和个性的想法',
    7 => '想法惊世骇俗，思维敏锐，做事细致，待人和善，温柔果断，有影响力，容易感染人',
    8 => '搞怪、无厘头、精灵、可爱、笑点多、冷、很聪明、善解人意、平易近人',
    9 => '细心、可爱、温柔、善解人意、影响力相当巨大',
);

$shortcomings = array(
    0 => '喜欢享受，意志不坚定，缺乏自省；过份要求公平',
    1 => '太偏执，有自闭和抑郁倾向，需要出口释放',
    2 => '有时候有点小任性，容易钻牛角尖',
    3 => '有点纠结，有点情绪化',
    4 => '小心思太多，纠结，性格矛盾',
    5 => '性格方面的弱点，有时给自己压力过大，急于求成，过犹不及',
    6 => '有时候有点小任性，容易钻牛角尖',
    7 => '有点纠结，有点情绪化',
    8 => '小心思太多，纠结，性格矛盾',
    9 => '性格方面的弱点，有时给自己压力过大，急于求成，过犹不及',
);

?>